from django import forms
from django.contrib.auth.forms import AuthenticationForm
from django import forms

DATE_CHOICES = (
    ("1", "Сначала новые"),
    ("2", "Сначала старые"),
)

FIELDS_CHOICES = (
    ("1", "1"),
    ("2", "2"),
    ("3", "3"),
    ("4", "4"),
    ("5", "5"),
    ("6", "6"),
    ("7", "7"),
    ("8", "8"),
    ("9", "9"),
    ("10", "10"),
    ("11", "11"),
    ("12", "12"),
    ("13", "13"),
    ("14", "14"),
    ("15", "15"),
    ("16", "16"),
    ("17", "17"),
    ("18", "18"),
    ("19", "19"),
    ("20", "20"),
    ("21", "21"),
    ("22", "22"),
    ("23", "23"),
    ("24", "24"),
    ("25", "25"),
    ("26", "26"),
    ("27", "27"),
    ("28", "28"),
    ("29", "29"),
    ("30", "30"),
    ("31", "31"),
    ("32", "32"),
    ("33", "33"),
    ("34", "34"),
    ("35", "35"),
    ("36", "36"),
    ("37", "37"),
    ("38", "38"),
    ("39", "39"),
    ("40", "40"),
    ("41", "41"),
    ("42", "42"),
    ("43", "43"),
)

PERIOD_CHOICES = (
    ('1', 'I квартал'),
    ('2', '-- январь'),
    ('3', '-- февраль'),
    ('4', '-- март'),
    ('5', 'II квартал'),
    ('6', '-- апрель'),
    ('7', '-- май'),
    ('8', '-- июнь'),
    ('9', 'III квартал'),
    ('10', '-- июль'),
    ('11', '-- август'),
    ('12', '-- сентябрь'),
    ('13', 'IV квартал'),
    ('14', '-- октябрь'),
    ('15', '-- ноябрь'),
    ('16', '-- декабрь'),
)


class DateForm(forms.Form):  # создание формы (выпадающий список)
    date_form_sort = forms.ChoiceField(choices=DATE_CHOICES)


class FieldForm(forms.Form):  # создание формы (выпадающий список)
    field_form_sort = forms.ChoiceField(choices=FIELDS_CHOICES)


class PeriodForm(forms.Form):
    period_form = forms.MultipleChoiceField(choices=PERIOD_CHOICES)